#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
data.aws_route53_zone.zone: Reading...
data.aws_caller_identity.current: Reading...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:431503237549:certificate/22849340-6414-47bc-9896-7f7f07afb0d3]
aws_s3_bucket.site_bucket: Refreshing state... [id=clearskies.info]
data.aws_caller_identity.current: Read complete after 0s [id=431503237549]
data.aws_route53_zone.zone: Read complete after 1s [id=Z10058853PSR0LC8UTZVI]
aws_route53_record.www["clearskies.info"]: Refreshing state... [id=Z10058853PSR0LC8UTZVI__1a269b3166a613452495dd82d687d5df.clearskies.info._CNAME]
aws_acm_certificate_validation.cert: Refreshing state... [id=2023-02-11 18:08:16.575 +0000 UTC]
aws_s3_bucket_website_configuration.site_bucket: Refreshing state... [id=clearskies.info]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3SUUXNS19FSQ3]
aws_route53_record.record_a: Refreshing state... [id=Z10058853PSR0LC8UTZVI_clearskies.info_A]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # aws_s3_bucket.site_bucket has changed
  ~ resource "aws_s3_bucket" "site_bucket" {
      ~ bucket_regional_domain_name = "clearskies.info.s3.amazonaws.com" -> "clearskies.info.s3.us-east-1.amazonaws.com"
        id                          = "clearskies.info"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E3SUUXNS19FSQ3"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (2 unchanged blocks hidden)
        }

      - origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "clearskies.info.s3.us-east-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "clearskies.info-static-cloudfront"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv3.1",
                ]
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_cloudfront_function.rewrite_index will be created
  + resource "aws_cloudfront_function" "rewrite_index" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              // Only rewrite if ends with '/' and does not look like a file
              if (request.uri.endsWith('/') && !request.uri.match(/\/[^\/]+\\.[^\/]+$/)) {
                request.uri += 'index.html';
              }
              return request;
            }
        EOT
      + comment         = "Rewrite folder requests to index.html"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "rewrite-index"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # aws_cloudfront_origin_access_control.site_oac will be created
  + resource "aws_cloudfront_origin_access_control" "site_oac" {
      + arn                               = (known after apply)
      + description                       = "OAC for CloudFront to access S3 bucket"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "site-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_route53_record.record_aaaa will be created
  + resource "aws_route53_record" "record_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "clearskies.info"
      + type            = "AAAA"
      + zone_id         = "Z10058853PSR0LC8UTZVI"

      + alias {
          + evaluate_target_health = true
          + name                   = "ddtbpn9od11lw.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_s3_bucket.site_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "site_bucket" {
      ~ force_destroy               = true -> false
        id                          = "clearskies.info"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ policy                      = (sensitive value)
        tags                        = {}
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "site_bucket_policy" {
      + bucket = "clearskies.info"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceArn" = "arn:aws:cloudfront::431503237549:distribution/E3SUUXNS19FSQ3"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudfront.amazonaws.com"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::clearskies.info/*",
                        ]
                      + Sid       = "AllowCloudFrontServicePrincipalReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region = "us-east-1"
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @tnijboer, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/plan.yml`*